app/Controllers/HutangController.php

SELECT *
FROM `hutang`
---
    public function index()
    {
		$data['vhutang'] = $this->hutang->findAll();