app/Controllers/LaporanController.php

SELECT *
FROM `laporan`
---
    public function index()
    {
		$data['vlaporan'] = $this->laporan->findAll();