app/Controllers/PemasukanController.php

SELECT *
FROM `pemasukan`
---
    public function index()
    {
		$data['vpemasukan'] = $this->pemasukan->findAll();

INSERT INTO `pemasukan` (`tanggal`, `jumlah`, `keterangan`) VALUES ('2024-12-06', '12000', 'print')
---
    public function create()
    {
        $this->pemasukan->insert([
            'tanggal' => $this->request->getPost('tanggal'),
            'jumlah' => $this->request->getPost('jumlah'),
            'keterangan' => $this->request->getPost('keterangan'),
        ]);