app/Controllers/PengeluaranController.php

    public function index()
    {
		$data['vpengeluaran'] = $this->pengeluaran->findAll();
---
SELECT *
FROM `pengeluaran`